#include <reg52.h>
#include <intrins.h>

#define uchar unsigned char		// ÒÔºóunsigned char¾Í¿ÉÒÔÓÃuchar´úÌæ
#define uint  unsigned int		// ÒÔºóunsigned int ¾Í¿ÉÒÔÓÃuint ´úÌæ


sbit LED     = P1^0;					// Ä£Ê½Ö¸Ê¾µÆ£¬ÁÁÊÇ×Ô¶¯Ä£Ê½£¬ÃðÊÇÊÖ¶¯Ä£Ê½
sbit Lamp    = P1^4; 					// Ì¨µÆ¿ØÖÆÒý½Å
sbit Key1    = P1^1;					// °´¼ü1£¬Ä£Ê½ÇÐ»»°´¼ü
sbit Key2    = P1^2; 					// °´¼ü2£¬ÁÁ¶È¼õÉÙ°´¼ü      
sbit Key3    = P1^3;					// °´¼ü3£¬ÁÁ¶ÈÔö¼Ó°´¼ü
sbit ADC_CS  = P2^3; 					// ADC0832µÄCSÒý½Å
sbit ADC_CLK = P2^0; 					// ADC0832µÄCLKÒý½Å
sbit ADC_DAT = P2^1; 					// ADC0832µÄDI/DOÒý½Å

uchar gCount=0;								// È«¾Ö¼ÆÊý±äÁ¿
uchar gIndex;									// ÁÁ¶È±äÁ¿£¬0ÊÇ×î°µ£¬9ÊÇ×îÁÁ£¬Ò»¹²10µµ

/*********************************************************/
// ºÁÃë¼¶µÄÑÓÊ±º¯Êý£¬timeÊÇÒªÑÓÊ±µÄºÁÃëÊý
/*********************************************************/
void DelayMs(uint time)
{
	uint i,j;
	for(i=0;i<time;i++)
		for(j=0;j<112;j++);
}



/*********************************************************/
// ADC0832µÄÊ±ÖÓÂö³å
/*********************************************************/
void WavePlus()
{
	_nop_();
	ADC_CLK = 1;
	_nop_();
	ADC_CLK = 0;
}



/*********************************************************/
// »ñÈ¡Ö¸¶¨Í¨µÀµÄA/D×ª»»½á¹û
/*********************************************************/
uchar Get_ADC0832()
{ 
	uchar i;
	uchar dat1=0;
	uchar dat2=0;
	
	ADC_CLK = 0;				// µçÆ½³õÊ¼»¯
	ADC_DAT = 1;
	_nop_();
	ADC_CS = 0;
	WavePlus();					// ÆðÊ¼ÐÅºÅ 
	ADC_DAT = 1;
	WavePlus();					// Í¨µÀÑ¡ÔñµÄµÚÒ»Î»
	ADC_DAT = 0;      
	WavePlus();					// Í¨µÀÑ¡ÔñµÄµÚ¶þÎ»
	ADC_DAT = 1;
	
	for(i=0;i<8;i++)		// µÚÒ»´Î¶ÁÈ¡
	{
		dat1<<=1;
		WavePlus();
		if(ADC_DAT)
			dat1=dat1|0x01;
		else
			dat1=dat1|0x00;
	}
	
	for(i=0;i<8;i++)		// µÚ¶þ´Î¶ÁÈ¡
	{
		dat2>>= 1;
		if(ADC_DAT)
			dat2=dat2|0x80;
		else
			dat2=dat2|0x00;
		WavePlus();
	}
	
	_nop_();						// ½áÊø´Ë´Î´«Êä
	ADC_DAT = 1;
	ADC_CLK = 1;
	ADC_CS  = 1;   

	if(dat1==dat2)			// ·µ»Ø²É¼¯½á¹û
		return dat1;
	else
		return 0;
} 



/*********************************************************/
// ¶¨Ê±Æ÷³õÊ¼»¯
/*********************************************************/
void TimerInit()
{
	TMOD = 0x01;				// Ê¹ÓÃ¶¨Ê±Æ÷0£¬¹¤×÷·½Ê½1	 
	TH0  = 252;					// ¸ø¶¨Ê±Æ÷0µÄTH0×°³õÖµ
	TL0  = 24;					// ¸ø¶¨Ê±Æ÷0µÄTL0×°³õÖµ	
	ET0  = 1;						// ¶¨Ê±Æ÷0ÖÐ¶ÏÊ¹ÄÜ
	EA   = 1;						// ´ò¿ª×ÜÖÐ¶Ï
	TR0	 = 1;						// Æô¶¯¶¨Ê±Æ÷0
}



/*********************************************************/
// ÊÖ¶¯¿ØÖÆ
/*********************************************************/
void ManualControl()
{
	// ÁÁ¶È¼õÉÙ
	if(Key2==0)					// Èç¹û°´¼ü2±»°´ÏÂÈ¥
	{
		if(gIndex>0)			// Ö»Òªµ±Ç°ÁÁ¶È²»Îª×îµÍ²ÅÄÜ¼õÉÙÁÁ¶È
		{
			gIndex--;				// ÁÁ¶È½µµÍÒ»µµ
			DelayMs(300);		// ÑÓÊ±0.3Ãë
		}
	}
	
	// ÁÁ¶ÈÔö¼Ó
	if(Key3==0)					// Èç¹û°´¼ü3±»°´ÏÂÈ¥
	{
		if(gIndex<9)			// Ö»Òªµ±Ç°ÁÁ¶È²»Îª×î¸ß²ÅÄÜÔö¼ÓÁÁ¶È
		{
			gIndex++;				// ÁÁ¶ÈÔö¼ÓÒ»µµ
			DelayMs(300);		// ÑÓÊ±0.3Ãë
		}
	}
}



/*********************************************************/
// ×Ô¶¯¿ØÖÆ
/*********************************************************/
void AutoControl(uchar num)
{
	if(num<59)														// ×îÁÁ
		gIndex=9;
	else if((num>65)&&(num<81))						// µÚ¶þÁÁ
		gIndex=8;
	else if((num>87)&&(num<103))					// µÚÈýÁÁ
		gIndex=7;
	else if((num>109)&&(num<125))
		gIndex=6;
	else if((num>131)&&(num<147))
		gIndex=5;
	else if((num>153)&&(num<169))
		gIndex=4;
	else if((num>175)&&(num<191))
		gIndex=3;
	else if((num>197)&&(num<213))
		gIndex=2;
	else if((num>219)&&(num<235))
		gIndex=1;
	else if(num>241)										 // ×î°µ
		gIndex=0;
}


sbit LED1=P3^0;
/*********************************************************/
// Ö÷º¯Êý
/*********************************************************/
void main()
{
	uchar ret;
	
	TimerInit(); 					// ¶¨Ê±Æ÷³õÊ¼»¯
	
	LED=0;								// Ö¸Ê¾µÆµãÁÁ(×Ô¶¯Ä£Ê½Ö¸Ê¾µÆ)
	ret=Get_ADC0832();		// »ñÈ¡AD²É¼¯½á¹û(»·¾³¹âÕÕÇ¿¶È)
	AutoControl(ret);			// ÉÏµçÏÈ½øÐÐÒ»´Î×Ô¶¯ÁÁ¶È¿ØÖÆ	
	AutoControl(ret+7);
	
	while(1)
	{
		/* Ä£Ê½ÇÐ»»¿ØÖÆ */
		if(Key1==0)					// Èç¹û°´¼ü1±»°´ÏÂÈ¥
		{
			LED=~LED;					// ÇÐ»»LEDµÆ×´Ì¬
			DelayMs(10);			// ÑÓÊ±Ïû³ý°´¼ü°´ÏÂµÄ¶¶¶¯
			while(!Key1);			// µÈ´ý°´¼üÊÍ·Å
			DelayMs(10);			// ÑÓÊ±Ïû³ý°´¼üËÉ¿ªµÄ¶¶¶¯
		}
			
		/* ÁÁ¶È¿ØÖÆ */
		if(LED==1)							// Èç¹ûLEDÊÇÃðµÄ
		{
			ManualControl();			// Ôò½øÐÐÊÖ¶¯¿ØÖÆ
		}
		else										// Èç¹ûLEDÊÇÁÁµÄ
		{
			ret=Get_ADC0832();		// »ñÈ¡AD²É¼¯½á¹û(»·¾³¹âÕÕÇ¿¶È)
			AutoControl(ret);			// ½øÐÐ×Ô¶¯¿ØÖÆ	
			DelayMs(200);
		}
	}
}


/*********************************************************/
// ¶¨Ê±Æ÷0·þÎñ³ÌÐò£¬1ºÁÃë
/*********************************************************/
void Timer0(void) interrupt 1
{
	TH0  = 252;						// ¸ø¶¨Ê±Æ÷0µÄTH0×°³õÖµ
	TL0  = 24;						// ¸ø¶¨Ê±Æ÷0µÄTL0×°³õÖµ	
	
	gCount++;							// Ã¿1ºÁÃë£¬gCount±äÁ¿¼Ó1
	
	if(gCount==10)				// Èç¹ûgCount¼Óµ½10ÁË
	{
		gCount=0;						// Ôò½«gCountÇåÁã£¬½øÈëÐÂÒ»ÂÖµÄ¼ÆÊý
		if(gIndex!=0)				// Èç¹ûËµÌ¨µÆ²»ÊÇ×î°µµÄ(Ï¨Ãð)
		{
			Lamp=0;						// Ôò°ÑÌ¨µÆµãÁÁ
		}
	}
	if(gCount==gIndex)		// Èç¹ûgCount¼ÆÊýµ½ºÍgIndexÒ»ÑùÁË
	{
		if(gIndex!=9)				// Èç¹ûËµÌ¨µÆ²»ÊÇ×îÁÁµÄ
		{
			Lamp=1;						// Ôò°ÑÌ¨µÆÏ¨Ãð
		}
	}
}




